In [1]:
import pandas as pd
import numpy as np

A challenge problem is: how to customize the order of the columns according to some user-defined criteria?

In [10]:
# data
df = pd.DataFrame({'col1':[1,2,3],'col2':[4,5,6],'col3':[7,8,9],'col4':['Feb','Jan','March']})

In [7]:
df

   col1  col2  col3   col4
0     1     4     7    Feb
1     2     5     8    Jan
2     3     6     9  March

In [13]:
# criterion
criterion = {'col2':0,'col3':1,'col4':3,'col1':2}

In [11]:
# now we do column wise, we have to concat a new row 
df.columns.rename('added_row').to_frame()

          added_row
added_row
col1           col1
col2           col2
col3           col3
col4           col4

In [12]:
df.columns.rename('added_row').to_frame().T

added_row  col1  col2  col3  col4
added_row  col1  col2  col3  col4

In [14]:
added_row = df.columns.rename('added_row').to_frame().T

In [15]:
df4sort = pd.concat([df,added_row],axis=0)

In [16]:
df4sort

added_row  col1  col2  col3   col4
0             1     4     7    Feb
1             2     5     8    Jan
2             3     6     9  March
added_row  col1  col2  col3   col4

#### Caveat: change the column name, otherwise, 'added_row' will be both a index label and a column level !!!!!

In [17]:
df4sort.columns.rename('',inplace=True)

In [18]:
df4sort

           col1  col2  col3   col4
0             1     4     7    Feb
1             2     5     8    Jan
2             3     6     9  March
added_row  col1  col2  col3   col4

In [19]:
# here, axis means which axis to shuffle
df4sort.sort_values(by=['added_row'],key=lambda x:x.map(criterion),inplace=True,axis=1)

In [20]:
df4sort

           col2  col3  col1   col4
0             4     7     1    Feb
1             5     8     2    Jan
2             6     9     3  March
added_row  col2  col3  col1   col4

In [22]:
df4sort.drop(index=['added_row'],inplace=True)

In [23]:
df4sort

  col2 col3 col1   col4
0    4    7    1    Feb
1    5    8    2    Jan
2    6    9    3  March